### Задача № 4.
### Задача 4: Петя, Катя и Сережа делают из бумаги журавликов.
### Вместе они сделали S журавликов.
### Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

### Решение 
n = int(input('Введите общее количество журавликов: '))
print((n//6), ((n//6)*4), (n//6))